{$mode TP}
{$R+,B+,X-}
{$codepage UTF-8}
///////////////////////////////////////////////////////////////////////
///                Задача 1  (вариант 2.5)    20 очков              ///
///////////////////////////////////////////////////////////////////////

{
Ввести непустую последовательность из символов-цифр (конец - точка). 
Вывести все цифры, которые встречаются в этой последовательности более 
одного раза. Требование: в решении (= в программе) разрешено использовать
ТОЛЬКО ОДНУ ПЕРЕМЕННУЮ (других вариантов решений не предлагать !).
}
    
program Task1(input,output);
var 
    {здесь расположить описание единственной переменной}
begin
    writeln('ФАМИЛИЯ ИМЯ    Задача 1 (вариант 2.5)');
    {здесь ваше решение}
    writeln
end.
